{"_type": "release", "_id": "release-beni", "name": "Beni", "slug": {"current": "beni"}, "artist": "WRACK", "bandcampUrl": "https://overmybody.bandcamp.com/album/beni", "coverUrl": "https://f4.bcbits.com/img/a0615475154_10.jpg", "externalId": "747384098", "releaseDate": "July 17, 2025", "type": "album", "aboutHtml": "WRACK - Beni [OMB018]\n<br>\n\n<br>\nWRACK, known for previous releases such as Hotto Kotto and Moon Beam (with B E N N), returns to Over My Body after nearly two years with his latest EP, Beni.\n<br>\n\n<br>\nBeni represents the culmination of WRACK’s artistic journey to date—a powerful statement shaped by years of experimentation and introspection. At the heart of the project lies a question that has long driven his work: what does it mean to create club music as a Japanese artist?\n<br>\n\n<br>\nWith this EP, WRACK offers one of his most refined answers. Beni seamlessly fuses the percussive intensity of global club sounds with melodic elements rooted in traditional Japanese scales. The result is a bold and personal exploration of identity, culture, and rhythm—crafted for the dancefloor, but resonating far beyond it. The album also including three special remixes by he B E N N, Titaniüm, and moemiki."}
{"_type": "release", "_id": "release-petals-of-nehan", "name": "Petals of Nehan", "slug": {"current": "petals-of-nehan"}, "artist": "W.ANNA.W", "bandcampUrl": "https://overmybody.bandcamp.com/album/petals-of-nehan", "coverUrl": "https://f4.bcbits.com/img/a0510770362_10.jpg", "externalId": "1044521383", "releaseDate": "June 19, 2025", "type": "album", "aboutHtml": "W.ANNA.W - Petals of Nehan [OMB017]\n<br>\n\n<br>\nPetals of Nehan unfolds as a sonic journey where powerful and unpredictable movements of sound intertwine with cultural influences and personal sensibilities. Each track shifts in form at times intense, at others restrained yet quietly imbued with an inner strength evoking petals drifting with intention. Through these evolving textures, the EP explores the power of music to bridge the inner and outer worlds.\n<br>\n\n<br>\nIn the collaborative track “Forsaken Voices” with xato, a flowing current of sound emerges from the merging of sensibilities, leading to a deeper musical exploration.\n<br>\n\n<br>\nThe EP also features remixes by Sweden-based duo Quit Life, France-based artist Ytem, and Austria-based Kenji Araki. Their contributions bring distinct perspectives shaped by their diverse cultural backgrounds, expanding the sonic landscape of the release.\n<br>\n\n<br>\nW.ANNA.W is a Japan based artist, vocalist, and producer who weaves ambient, experimental, and organic sounds into intimate yet expansive sonic landscapes. Her music transcends genre boundaries, evolving freely with quiet, expressive depth. Through her work, she invites listeners into a reflective, introspective dialogue a space to pause, listen, and feel."}
{"_type": "release", "_id": "release-moon-beam", "name": "Moon Beam", "slug": {"current": "moon-beam"}, "artist": "B E N N x WRACK", "bandcampUrl": "https://overmybody.bandcamp.com/album/moon-beam", "coverUrl": "https://f4.bcbits.com/img/a3116351302_10.jpg", "externalId": "224408493", "releaseDate": "July 27, 2023", "type": "album", "aboutHtml": "B E N N x WRACK - Moon Beam [OMB007] \n<br>\n\n<br>\n\n<br>\nMoon Beam, a collaborative EP composed by B E N N and WRACK across Taipei and Tokyo, the album combines two distinct personalities to interpret the way of GQOM to dance-floor hybrids.\n<br>\n\n<br>\nWRACK returns on the label a year after his last Over My Body release with debut collaboration. B E N N, in the production, attempting to reach out the diverse dimensions into a journey, The whole journey also includes a remix by prolific Japanese producer T5UMUT5UMU."}
{"_type": "release", "_id": "release-oneiric", "name": "ONEIRIC", "slug": {"current": "oneiric"}, "artist": "Max Dahlhaus", "bandcampUrl": "https://overmybody.bandcamp.com/album/oneiric", "coverUrl": "https://f4.bcbits.com/img/a3723654467_10.jpg", "externalId": "1003819792", "releaseDate": "May 1, 2025", "type": "album", "aboutHtml": "Max Dahlhaus – ONEIRIC [OMB016]\n<br>\n\n<br>\nBerlin-based producer and audiovisual artist Max Dahlhaus returns on the label two year after his last Over My Body debut release with a dream in Sound.\n<br>\n\n<br>\nA system of sound built from fragmented memories, shifting rhythms, and digital distortions. ONEIRIC exists in the space between the organic and the synthetic, between structure and collapse. Here, cello strings vibrate in artificial landscapes, field recordings blur into machine pulses, and AI-generated voices attempt—futilely—to replicate human emotion. It’s a record untethered from genre, operating instead as a dream-state where time signatures fracture, grooves morph, and textures breathe.\n<br>\n\n<br>\nThe title ONEIRIC—meaning “relating to dreams”—perfectly encapsulates the LP’s unstable logic. Like a lucid dream, the music moves with both intention and unpredictability. Each track is its own self-contained world, but together they form an evolving structure that reprograms itself as it plays. Max Dahlhaus builds this sonic architecture through an array of techniques: recording cello and breaking glass, capturing field sounds, feeding AI-generated elements into Ableton, and letting the collision of these methods shape the outcome. Vocalists CATNAPP and Ayu Okakita appear as ghostly presences—human touchpoints in a landscape that is constantly shifting. ONEIRIC is as much a soundtrack for the body as it is for the mind—cinematic in scope, but wired for the club, where rhythm dictates movement and sound overwhelms space."}
{"_type": "release", "_id": "release-xorath", "name": "Xorath", "slug": {"current": "xorath"}, "artist": "Digitonica, Lujiachi", "bandcampUrl": "https://overmybody.bandcamp.com/album/xorath", "coverUrl": "https://f4.bcbits.com/img/a0534762536_10.jpg", "externalId": "346591216", "releaseDate": "April 17, 2025", "type": "album", "aboutHtml": "Digitonica, Lujiachi - Xorath [OMB015]\n<br>\n\n<br>\nXorath is a two-track EP by Digitonica &amp; Lujiachi, built around sharp, driving percussion and a dense, detailed sonic language. The rhythm grabs hold from the very start, pulling into a state where repetition becomes trance and structure gives way to instinct. With a ritual energy running through both tracks — not ceremonial, but physical, urgent. Elements of sci-fi sound design are embedded deep in the mix, not drawing attention, but shaping the atmosphere from within. The sound shifts gradually, drawing deeper into a darker space, where movement becomes a way to forget, or to endure.\n<br>\n\n<br>\nWritten in response to the tension of the present, Xorath doesn’t seek resolution. It stays inside the feeling — steady, precise, and quietly consuming."}
{"_type": "release", "_id": "release-vessels-of-chaos-mercurial-blood", "name": "Vessels of Chaos :  Mercurial Blood", "slug": {"current": "vessels-of-chaos-mercurial-blood"}, "artist": "Griigg", "bandcampUrl": "https://overmybody.bandcamp.com/album/vessels-of-chaos-mercurial-blood", "coverUrl": "https://f4.bcbits.com/img/a3042582942_10.jpg", "externalId": "1166557579", "releaseDate": "December 26, 2024", "type": "album", "aboutHtml": "Griigg - Vessels of Chaos : Mercurial Blood [OMB014]\n<br>\n\n<br>\n“Consumed by the Void\n<br>\nIn darkness we crawl\n<br>\nIslands of dreams in a sea of emptiness\n<br>\nThrough mud and moonlight\n<br>\nWe celebrate noise and harshness, bliss and glitters\n<br>\nWe are the makers of stars, the grinders of chaos\n<br>\nThe glue that make everything whole\n<br>\nCasting the sublime into oblivion\n<br>\nOur chants make the skies cry\n<br>\nAnd the mountains leak\n<br>\nBody as a cauldron\n<br>\nAkin we breathe into eternity\n<br>\nDust to dust, from flesh bags to astral bodies”\n<br>\n\n<br>\nVessels of Chaos is a musical tale - an ode to change and reconfiguration. Set in a crumbling lorescape, it explores primitive forms of collective organizations rooted in material reality and its associated imperfections.\n<br>\n\n<br>\nIt takes the form of a double EP, released on MONTAGE and Over My Body.\n<br>\n\n<br>\nBoth EPs explore different directions with similar structures. Seen as complementary, they explore the use of voice and organic noises as source material to craft hypnotizing soundscapes and cathartic rhythms. Infused with paleofuturist imagery, they imagine new forms of communities, beliefs, rituals and worships - cherishing communion, shifting perspectives and internal transformations as ways to situate ourselves in the emptiness of existence.\n<br>\n\n<br>\nMercurial Blood combines muddy subs with cavernous vocals, mutilated by fractured beats, rough textures and crystalline hits - for an abrasive harshclub exploration of friction as an integral part of dynamic change.\n<br>\n\n<br>\nGriigg is a Paris-based artist exploring the interactions between space, image and sound and their ability to craft powerful narratives and\n<br>\nimaginaries. Since 2018, he also co-runs the Club Late Music\n<br>\nx Global URL Nation open-source and collaborative label/community, gathering worldwideartists to experiment together with collective\n<br>\nprocesses of creation, organizing releases,events, workshops and more."}
{"_type": "release", "_id": "release-godspeed", "name": "GODSPEED", "slug": {"current": "godspeed"}, "artist": "SMT3X", "bandcampUrl": "https://overmybody.bandcamp.com/album/godspeed", "coverUrl": "https://f4.bcbits.com/img/a0404063958_10.jpg", "externalId": "625430198", "releaseDate": "November 21, 2024", "type": "album", "aboutHtml": "SMT3X - GODSPEED [OMB013]\n<br>\n\n<br>\nGodspeed is an eclectic six-track EP that explores various facets of global bass music, bringing an experimental, radical, post-club edge to French pop. Framboise’s sensual vocals and incisive flows merge with indus-tribal beats, blending influences from gqom to hardcore drums and IDM textures. The EP includes “DESPOTE/FROST,” a collaboration with Kenyan producer Slikback, and “CHAV,” featuring Franco-Chinese rapper LK de l'Hotel Moscou, based in London, featuring two remixes by Endgame and B E N N, the visionary heads of Precious Metals &amp; Over My Body, two of the most cutting-edge labels in new club music scene today.\n<br>\n\n<br>\n“DESPOTE/FROST” is a hybrid, experimental track that sits at the crossroads of French rap and apocalyptic post-club sounds. In this piece, SMT3X and Slikback draw on the energy of their origins (Iran, Italy, Kenya) to produce an abrupt, uncompromising sound. Their rhythms move between tribal and industrial, evoking artists like Kavari, Arca, and Amnesia Scanner.\n<br>\n\n<br>\nSMT3X is a Paris-based duo: Framboise, an Italo-goth singer from the French Riviera, and Guiv, a nerdy Persian producer. Their sound is as fiery as the energy of Naples and as chaotic as the sprawling arteries of Tehran, weaving southern European and ghetto-gothic Middle Eastern influences into dark and seductive deconstructed club music. SMT3X enjoys pushing the boundaries of rap and French pop, combining sensual lyrics and grime flows with elements drawn from hardcore, IDM, and gqom to create something both brutal and caliente."}
{"_type": "release", "_id": "release-paths-and-patches", "name": "Paths and Patches", "slug": {"current": "paths-and-patches"}, "artist": "Rumina", "bandcampUrl": "https://overmybody.bandcamp.com/album/paths-and-patches", "coverUrl": "https://f4.bcbits.com/img/a2347719555_10.jpg", "externalId": "471027829", "releaseDate": "October 3, 2024", "type": "album", "aboutHtml": "Rumina - Paths and Patches [OMB012]\n<br>\n\n<br>\n\"Paths and Patches\" delves into mysticism and rituals, blending dark, percussive electronic soundscapes with echoes of ancestral traditions. The album includes 4 original tracks by Rumina &amp; remixes by WRACK, Wanton Witch &amp; B E N N.\n<br>\n\n<br>\nRumina is a DJ, artist, and producer from Malmö, Sweden. Since 2018, she has been an integral part of the dynamic music and studio collective FNGRLCKN. She has been a resident at Retreat Radio since 2019, where she hosts her monthly program Rattle. Rumina draws inspiration from an eclectic mix of genres and influences, such as deconstructed club, folk, punk, and dembow, constantly pushing the boundaries of her sound."}
{"_type": "release", "_id": "release-nox-flamma", "name": "Nox-flamma", "slug": {"current": "nox-flamma"}, "artist": "Tufi, DIGITONICA", "bandcampUrl": "https://overmybody.bandcamp.com/album/nox-flamma", "coverUrl": "https://f4.bcbits.com/img/a2815280981_10.jpg", "externalId": "1321247475", "releaseDate": "July 18, 2024", "type": "album", "aboutHtml": "Digit0nica &amp; Tufi - Nox-flamma [OMB011]\n<br>\n\n<br>\nDigit0nica and Tufi embarked on a collaborative journey a year ago, exchanging sounds throughout the web. Their partnership resulted in a mesmerizing EP, weaving threads of connection through the storm. This vibrant collaboration traverses unseen dimensions, defying classification. \n<br>\n\n<br>\nDigit0nica is an audiovisual artist, sound designer, singer, and electronic composer, based somewhere on the internet. Having worked in the past with a variety of genres, at the moment is engaged in post-electronics, post-internet, post-club, meta-punk, deconstructed music with an interweaving of academic and pop tradition and a lot of voice manipulation like alien processing. The music has a psychedelic and surrealistic tone, like a living voice coming from the digital environment. Hosts her own show \"Lunar Prism '' on Ola radio. Published on such labels as Postworld, Hyperboloid, Mutants1000000, Internetghetto, Infinito Audio, Hyperlink, Exiles and more.\n<br>\n\n<br>\nArgentinian DJ/producer and sound engineer based in Berlin.\n<br>\nTufi's artistic output acknowledges the diversity of different musical genres and converges them through wild and experimental productions and DJ sets. While exploring the eclectic, deviant and niche subgenres of electronic music, Tufi likes to relentlessly hop between styles to enchant listeners with hard-hitting breakbeats on one hand and blissful sonic sensations on the other."}
{"_type": "release", "_id": "release-transmute", "name": "Transmute", "slug": {"current": "transmute"}, "artist": "Burnt Offerings", "bandcampUrl": "https://overmybody.bandcamp.com/album/transmute", "coverUrl": "https://f4.bcbits.com/img/a0889152889_10.jpg", "externalId": "4128430819", "releaseDate": "June 20, 2024", "type": "album", "aboutHtml": "Burnt Offerings - Transmute [OMB010]\n<br>\n\n<br>\n“The Overload flooded us. Consumed Us. Made us whole again”. As the time when \"Transmute\" was taking shape, so did the multiple global crisis. \"Transmute\" is an effort to represent the human spirit and its resiliency amidst the uncertainty, hopelessness and chaos of the current era.\n<br>\n\n<br>\nBurnt Offerings is a duo consisting of Arthur Bdt (Arson) and Andres Leon (Laopé). Their music oscillates from Drone to Cuban music, incorporating everything from traditional Latin instruments to modern sound design tools. These influences converge outside of their original contexts through heavy digital audio processing, deconstruction, and arrangement.The sound can be best described as a disjointed yet symbiotic relationship between the past and the now."}
{"_type": "release", "_id": "release-fiori-notturni", "name": "Fiori Notturni", "slug": {"current": "fiori-notturni"}, "artist": "Capiuz", "bandcampUrl": "https://overmybody.bandcamp.com/album/fiori-notturni", "coverUrl": "https://f4.bcbits.com/img/a0666744917_10.jpg", "externalId": "1304064940", "releaseDate": "May 16, 2024", "type": "album", "aboutHtml": "Capiuz - Fiori Notturni [OMB009]\n<br>\n\n<br>\nCapiuz returns on the label with a new club-ready album that slashes through a nocturnal forest landscape with fluorescents and violent bursts of color. Taking its name from a series of paintings called “Bande di Fiori Notturni” by Italian artist Alice Visentin, the project goes through a wide array of influences and bpms. Terra Nuda (naked earth) acts as an opener fusing a foggy drone with drum breaks and dance hall syncopations. Hectic follows up with a more bass oriented attitude incarnated in a heavy pounding kick pattern and driven by metallic drums with a restless spirit. The sounds and textures of Fiori Notturni are heavily inspired by the works of John Cage and his use of percussive instruments for both rhythmic and textural purposes. These influences become pretty clear in slower cuts like Black Needle and the title track, where jingles, rattles and other high-pitched instruments create a moving bed for the rhythmic section. Other works such as 0400 and the collaboration with label head B E N N, Lunar Eclipse, bring a faster pace to the project with a higher focus on rhythmic layering. Before giving its way to the Ancestral Vision remix, the “night” is closed off by Hallucinogen, a longer track driven by a steady kick that plays with different odd timed patterns to create an exciting and enveloping trip. \n<br>\n\n<br>\nCapiuz is the experimental dance project of producer and performer Luca Favaro. Based in Italy, his genre-merging production focuses on exploring rhythm and sound design in a club context. Often leaning towards live performances, Capiuz’s music takes the form of a heavy hitting outburst filled with heavy bass, breakcore progressions and granular textures. He is currently the host of a show on Radio Raheem and has published with Unizone, Over My Body and Early Reflex. As a programmer he’s developing max for live devices with HIDE Productions, including granular audio effects and instruments and flexi..."}
{"_type": "release", "_id": "release-apex-union-split-01-x-club-late-music", "name": "Apex Union [SPLIT-01 x Club Late Music]", "slug": {"current": "apex-union-split-01-x-club-late-music"}, "artist": "Lujiachi, Bungalovv", "bandcampUrl": "https://overmybody.bandcamp.com/album/apex-union-split-01-x-club-late-music", "coverUrl": "https://f4.bcbits.com/img/a2752375797_10.jpg", "externalId": "832109350", "releaseDate": "February 6, 2024", "type": "album", "aboutHtml": "Pre-Order / Purchase:  \n<br>\n<a href=\"https://clublatemusic.bandcamp.com/album/apex-union-split-01-x-over-my-body\">clublatemusic.bandcamp.com/album/apex-union-split-01-x-over-my-body</a>\n<br>\n\n<br>\n\n<br>\n Club Late Music &amp; Over My Body team up for a joint release! Welcome Apex Union, a split EP featuring Bungalovv &amp; Lujiachi with remixes by B E N N, Dj Animebby, DJ Würm &amp; jondu.\n<br>\n\n<br>\nThe release initiates the new CLM collaborative series called SPLIT - a simple format where one member from the Global URL Nation shares an EP with an artist from another label or collective, and also marks the first official collaboration of young Taiwan-based Over My Body with another label! This joint collab is pretty straightforward : two artists, two tracks each and remixes by members of both collectives.\n<br>\n\n<br>\nOver the past few years, Bungalovv and Lujiachi have affirmed and cultivated unique sonic palettes that seduced local and international scenes alike. Their encounter on Apex Union initiates a dialog, a weaving of their extended footprints where throbbing basses intertwine with piercing noises, sharp percussions and spiraling voices - resulting in four tracks that will shred, tear and enchant the firmest minds and the stiffest bodies.\n<br>\n\n<br>\nThe original tracks are reinterpreted by B E N N &amp; jondu from the Over My Body roster, as well as Dj Würm and Dj Animebby from the GUN community, extracting the core essence of the originals to infuse them with raw flavors, that will perfectly soundtrack the haziest cave raves and bleakest winter nightwalks.\n<br>\n\n<br>\n\n<br>\n++ TRACKLIST ++\n<br>\n\n<br>\n01. Bungalovv - In Between Car Parts\n<br>\n02. Lujiachi - Segmented Dream\n<br>\n03. Bungalovv - Xylem\n<br>\n04. Lujiachi - Nerve\n<br>\n05. Bungalovv - In Between Car Parts (Dj Würm Remix)\n<br>\n06. Lujiachi - Segmented Dream (Dj Animebby Remix)\n<br>\n07. Bungalovv - Xylem (B E N N Remix)\n<br>\n08. Lujiachi - Segmented Dream (jondu Remix) \n<br>\n\n<br>\n\n<br>\nTracks pr..."}
{"_type": "release", "_id": "release-ninsei-lane", "name": "Ninsei Lane", "slug": {"current": "ninsei-lane"}, "artist": "Max Dahlhaus", "bandcampUrl": "https://overmybody.bandcamp.com/album/ninsei-lane", "coverUrl": "https://f4.bcbits.com/img/a2604856864_10.jpg", "externalId": "697003112", "releaseDate": "October 19, 2023", "type": "album", "aboutHtml": "Max Dahlhaus - Ninsei Lane [OMB008]\n<br>\n\n<br>\nBerlin Based audio-visual artist and producer Max Dahlhaus contributes his first debut album on Over My Body with his energetic production along with two remixes by by talented Mars89 &amp; Trngs.\n<br>\n\n<br>\nFirst track \"And Then It Whispered\" was inspired by the atmospheric visuals of the avant-garde film \"Valhalla Rising\" by Nicolas Winding Refn. As Max immersed himself in thought-provoking silence of the movie, He let his imagination run wild, resulting in an ambient work that will transport people to introspective realms. Title track \"Ninsei Lane.\" is a challenge for Max to create a cinematic but clubby banger in under three minutes. It was a fun task which to explore new boundaries while keeping the production process fresh.The collaborative track \"Chrome Spine.\"with one another talented artists Kronom, which is crafted a club track that adds a whole new layer to the album. The album also including two remixes by Mars89 &amp; Trngs that bring unique flavors to \"Ninsei Lane.\" Mars89 offers a slow, driving interpretation, weaving a mesmerizing sonic journey that complements the original's atmospheric vibes. On the other hand, Trngs delivers a hard-hitting remix, infusing the track with a punchy and energetic rhythm that's sure to ignite the dance floor.\n<br>\n\n<br>\nMax Dahlhaus is a Berlin-based audio-visual artist and producer known for his unique approach to music and visuals. His work blurs the boundaries between contrasts like emotional and abstract, repetition and detail, opulence and minimalism. Dahlhaus' music is cinematic, industrial, and experimental, immersing listeners in a symphony of sound. His meticulous production and mixing techniques are a testament to his expertise in the field. He's also known for his captivating visuals, creating an immersive sensory experience when combined with his music."}
{"_type": "release", "_id": "release-dumpling-machine-xp", "name": "Dumpling Machine. XP", "slug": {"current": "dumpling-machine-xp"}, "artist": "Sabiwa", "bandcampUrl": "https://overmybody.bandcamp.com/album/dumpling-machine-xp", "coverUrl": "https://f4.bcbits.com/img/a1040485148_10.jpg", "externalId": "694702552", "releaseDate": "April 20, 2023", "type": "album", "aboutHtml": "Sabiwa - Dumpling Machine. XP EP [OMB006]\n<br>\n\n<br>\nTaiwan borned, Berlin based artist Sabiwa joins label by a single album - “Dumpling Machine. XP”, which she mixes noises with sick grooves and complex patterns of rhythm. Blending with the randomness and unpredictable sound.\n<br>\n\n<br>\nSabiwa is an experimental electronic producer and performer from 未知. Her first approach to music was inside an aquarium; she started playing Cello at the age of 12, developing later a deep interest in electronic music, sound design and field recording. She produces, records and dissects sounds from natural and synthetic sources, making them interact with complex texture and abstract patterns, also using her voice processed as guiding path in her compositions. She is also curating the live visual for her performances. She composed soundtracks for art performances and documentaries, collaborating with numerous artists and musicians. She is actually working in between Berlin, Taipei and Torino as audio-visual producer.\n<br>\n\n<br>\nProduced and mixed by Sabiwa\n<br>\nMastering by Sabiwa\n<br>\nArtwork by Ray / jinji_pato / Jîn (XTRUX) \n<br>\n<a href=\"https://www.instagram.com/xtrux_official/\" rel=\"nofollow ugc\" referrerpolicy=\"strict-origin-when-cross-origin\">www.instagram.com/xtrux_official/</a>"}
{"_type": "release", "_id": "release-saam", "name": "SAAM", "slug": {"current": "saam"}, "artist": "Capiuz, Leese", "bandcampUrl": "https://overmybody.bandcamp.com/album/saam", "coverUrl": "https://f4.bcbits.com/img/a1298637559_10.jpg", "externalId": "2037998532", "releaseDate": "March 30, 2023", "type": "album", "aboutHtml": "Capiuz x Leese - SAAM EP [OMB005]\n<br>\n\n<br>\n\"Embrace your primal nature and let the frenzied beat lead you back to your ancestral roots\". Leese and Capiuz join forces for a new split EP on Over My Body. Along with two mutual remixes of previous recordings and a brand new track from the experimental oriented duo.\n<br>\n\n<br>\nCapiuz is the experimental dance project of producer and performer Luca Favaro. Based in Italy, his genre-merging production focuses on exploring rhythm and sound design in a club context. Often leaning towards live performances, Capiuz’s music takes the form of a heavy hitting outburst filled with heavy bass, breakcore progressions and granular textures.\n<br>\n\n<br>\nLeese, based in Brussels, is an electronic music artist who has gained recognition for her unique style blending break and tribal influences. She recently signed two EPs with label Yuku, one of which was named the Best Bandcamp Release of April, and performs at clubs and festivals throughout Europe. On stage, Leese delivers a passionate and energetic performance, mesmerizing her audience with her powerful beats and enchanting atmospheres. She is becoming increasingly well-known in the electronic/bass music scene and her project is continually evolving and developing.\n<br>\n\n<br>\nAll tracks produced and mixed by Capiuz &amp; Leese\n<br>\nMastering by B E N N\n<br>\nArtwork by ERRANTH \n<br>\n<a href=\"https://www.instagram.com/laetaph/\" rel=\"nofollow ugc\" referrerpolicy=\"strict-origin-when-cross-origin\">www.instagram.com/laetaph/</a>"}
{"_type": "release", "_id": "release-hotto-kotto", "name": "Hotto Kotto", "slug": {"current": "hotto-kotto"}, "artist": "WRACK", "bandcampUrl": "https://overmybody.bandcamp.com/album/hotto-kotto", "coverUrl": "https://f4.bcbits.com/img/a1821086039_10.jpg", "externalId": "2530939690", "releaseDate": "August 4, 2022", "type": "album", "aboutHtml": "WRACK - Hotto KottoEP [OMB004]\n<br>\n\n<br>\nSince \"Narimasu\" EP released last year by label USI KUVO (Tokyo), Tokyo based producer DJ/Producer WRACK has been seeking to make more Japan-Style club music. As for the first release on the label, WRACK combines genres like GQOM and GORGE with this 4-track EP album \"Hotto Kotto\", which is also keeping his Japanese scale style and iconic club sound.\n<br>\n\n<br>\nWRACK has released many bangers on full-length albums and compilations in recent years, with labels such as NAAFI, Eco Futurism Corporation, Club Late Music, Oxyorange, Absurd TRAX, CyberSonicLA, Babel Records. He also organized club party CHEMICAL MONSTERS in Tokyo which invited NAAFI's Imaabs, Lao, Zutzut, Fausto Bahia, Mexican Jihad, STAYCORE's Dinamarca, Mechatok, Intruder Alert's B.YHZZ, KRY etc."}
{"_type": "release", "_id": "release-mantis", "name": "Mantis", "slug": {"current": "mantis"}, "artist": "Lujiachi", "bandcampUrl": "https://overmybody.bandcamp.com/album/mantis", "coverUrl": "https://f4.bcbits.com/img/a2255575529_10.jpg", "externalId": "3022714659", "releaseDate": "June 23, 2022", "type": "album", "aboutHtml": "Lujiachi - Mantis EP [OMB003]\n<br>\n\n<br>\nTwo years after his last release, Taipei producer Lujiachi returns in 2022 with Mantis, a new EP focused on heavy, percussion-driven tracks that roll out at around the 100 BPM mark. Each cut is tied together by snarling, fuzzed-out bass and metallic drum sounds, sounding like hard drum blaring out of a busted Marshall stack. In the brutal opener “Link,” sludge metal bass tones mingle with a reoccurring sample of labored breathing. Kick and snare are buffeted by all manner of glass-breaking and metal-smashing percussive noise, which threaten to tear the track apart yet somehow end up just making the groove even stronger. The title track begins with a crackle of distortion, announcing the arrival of a rumbling bassline that moves with a brash swagger echoing Lujiachi’s club edits of old school Taiwanese pop. As an eerily insectoid plucked synth figure stalks the high end, the kick locks into a 4/4 stomp to draw us to a lento violento-like conclusion.\n<br>\n\n<br>\nLujiachi’s peers in Taipei’s underground scene also contribute two remixes: psychedelic explorers Mong Tong transform “Link” into a launchpad for waves of pentatonic surf guitar, while emerging producer Sandy’s Trace retools the same track for maximum club pressure."}
{"_type": "release", "_id": "release-pulverized", "name": "Pulverized", "slug": {"current": "pulverized"}, "artist": "Capiuz", "bandcampUrl": "https://overmybody.bandcamp.com/album/pulverized", "coverUrl": "https://f4.bcbits.com/img/a0126209546_10.jpg", "externalId": "3151893774", "releaseDate": "May 5, 2022", "type": "album", "aboutHtml": "Capiuz - Pulverized EP [OMB002]\n<br>\n\n<br>\nCapiuz is the experimental dance project of producer and performer Luca Favaro. Based in Italy, his genre-merging production focuses on exploring rhythm and sound design in a club context. Often leaning towards live performances, Capiuz’s music takes the form of a heavy hitting outburst filled with heavy bass, breakcore progressions and granular textures. \n<br>\n\n<br>\nPulverized EP encapsulates a sombre and hectic atmosphere. On Bling Ring, a simple reggaeton beat is turned into a slow and heavy pulsation topped with thematic rhythms and a little faster in its tempo. \n<br>\n\n<br>\nPulverized enters a more ritualistic soundscape with a steady, unrelenting pulse, distant drums and granulized samples.\n<br>\n\n<br>\nAll tracks produced and mixed by Capiuz\n<br>\nMastering by B E N N\n<br>\nArtwork by Ray/ Xtrux \n<br>\n<a href=\"https://www.instagram.com/xtrux_official/\" rel=\"nofollow ugc\" referrerpolicy=\"strict-origin-when-cross-origin\">www.instagram.com/xtrux_official/</a>"}
{"_type": "release", "_id": "release-how-to-respond-to-turmoil", "name": "How To Respond To Turmoil", "slug": {"current": "how-to-respond-to-turmoil"}, "artist": "personalbrand", "bandcampUrl": "https://overmybody.bandcamp.com/album/how-to-respond-to-turmoil", "coverUrl": "https://f4.bcbits.com/img/a0529542495_10.jpg", "externalId": "4263469589", "releaseDate": "March 31, 2022", "type": "album", "aboutHtml": "personalbrand - How To Respond To Turmoil EP [OMB001]\n<br>\n\n<br>\nexperimental and apocalyptic club DJ and producer Personalbrand. Currently based in London after 3 years in the Taiwan scene, his productions mix up grime, garage and hardcore sounds into twisted new forms, exuding feelings of anthropocenal anxiety and post-future optimism.\n<br>\n\n<br>\nHow To Respond To Turmoil is personalbrand's attempt to use hard dance as a framework to deal with individual and global turbulence. It was created during a time of deteriorating mental health and following a scattershot binge of app-based ancient wisdom, Youtube motivational speakers, contradictory Quora advice, and self-care blogs. Over two tracks, personalbrand contemplates whether hard times require hard music. Can accelerated tempos and relentless drums sooth a sense of disorder, or just add to it?\n<br>\n\n<br>\nOn EMBRACE CHAOS, hints of optimism creep out of anarchic competing melodies, frantic snares, and polyrhythmic percussion elements.\n<br>\n\n<br>\nPURSUE PAIN delves further into the idea of accepting life's difficulties. A disembodied digitised voice repeats a mantra-like phrase about internalised pain over pounding kicks and a hypnotic morphing synth.\n<br>\n\n<br>\nAll tracks produced and mixed by personalbrand \n<br>\nMastering by B E N N \n<br>\nArtwork by Ray/ Xtrux \n<br>\n<a href=\"https://www.instagram.com/xtrux_official/\" rel=\"nofollow ugc\" referrerpolicy=\"strict-origin-when-cross-origin\">www.instagram.com/xtrux_official/</a>"}
{"_type": "release", "_id": "release-koma-vol-1", "name": "Koma vol.1", "slug": {"current": "koma-vol-1"}, "artist": "Various Artists", "bandcampUrl": "https://overmybody.bandcamp.com/album/koma-vol-1", "coverUrl": "https://f4.bcbits.com/img/a4069287329_10.jpg", "externalId": "2885070160", "releaseDate": "October 28, 2021", "type": "album", "aboutHtml": "OverMyBody, the Taiwan-Based avant-garde imprint curated by&nbsp;B E N N, celebrates its first anniversary with album compilation from closed friends and affiliates, half Taiwanese, half internationals. 'Koma vol.1' allows seven different producers to create different aspects drawing on definition of experimental drums that they're not typically known for.\n<br>\n\n<br>\nThe release features music from Rain Liou, Dave N.A., ZAGAM, Sandy's Trace, personalbrand, Alica and B E N N, the record running the gamut from psyched-out compositions to drum and dance materials, with deadly blows of percussion, stereo-imaging coexisting in a gorgeous realm of artistic aesthetics.\n<br>\n\n<br>\nDave N.A. is an Armenian music producer who was recently released on Club Chai , Kepasaparadoks and Medium Raw Records and he is running FNTSY record label, \"Datedrumz\" characterized his own realms by high resonating percussions and hypnotic rhythm.\n<br>\n\n<br>\nSandy's Trace channels the ghosts of early 2010's club melodies into a pummeling, propulsive beat. Distended textures swirl in and out over a pneumatic volley of percussion, threatening to fracture under pressure at any moment's notice.\"\n<br>\n\n<br>\nZAGAM is above all his sensory experience on production, \"Landutopia \" above the electronic post club, filled with dark, industrial scenes, as well as narrative music that he shapes. His universe is part of a utopia, similar to a dystopia. He traces any Chaotic event from the Black Death phenomenon with his crow mask, which adds a tragic and pandemic touch to the story of his muisc.\n<br>\n\n<br>\npersonalbrand is an experimental producer and DJ, currently in the UK after 3 years in Taiwan. His debut ep SHARED UNREALITIES was released on TAR earlier this year, with tracks played on NTS, Ma3azef, Rinse, and more.His track COMMUNITAS continues an exploration of reconstructing grime motifs into a hybrid club framework. A repeating alien-like chant calls out over jerky, jabbing kicks, as glitches from ..."}
